amznhacker/g1-ESP32-S3-Touch-LCD-1.85C/sdkconfig.defaults
# Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_SPP_ENABLED=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LEDC driver for backlight
CONFIG_DRIVER_LEDC_ENABLED=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y